[
  {
    "id": "proj1",
    "title": "Innovative Web App",
    "description": "This project demonstrates advanced React techniques with server-side rendering for optimal performance. Features include real-time data visualization, responsive UI components, and accessibility compliance.",
    "image": "assets/proj1-800.webp",
    "alt": "A screenshot of the Innovative Web App interface showing data visualization components",
    "github": "https://github.com/katulevskiy/project-one",
    "tags": "React, Node.js, TypeScript, Accessibility"
  },
  {
    "id": "proj2",
    "title": "Creative Design System",
    "description": "A comprehensive design system built to ensure consistency across multiple applications. Includes a component library, design tokens, and documentation for developers and designers to maintain a cohesive user experience.",
    "image": "assets/proj2-800.webp",
    "alt": "Components from the Creative Design System displayed in a grid layout",
    "github": "https://github.com/katulevskiy/project-two",
    "tags": "UI/UX, CSS, Storybook, Design Systems"
  },
  {
    "id": "proj3",
    "title": "Dynamic Data Solution",
    "description": "This application processes large datasets in real-time, providing actionable insights through an intuitive dashboard. Built with performance in mind, it handles millions of data points while maintaining responsive interactions.",
    "image": "assets/proj3-800.webp",
    "alt": "Dashboard interface showing real-time data processing visualizations",
    "github": "https://github.com/katulevskiy/project-three",
    "tags": "Data Visualization, API Integration, Real-time Processing"
  },
  {
    "id": "proj4",
    "title": "Cutting-edge Tech Exploration",
    "description": "An experimental project exploring emerging web technologies including WebGL, 3D rendering, and immersive user experiences. This forward-thinking application pushes the boundaries of what's possible in browser-based applications.",
    "image": "assets/proj4-800.webp",
    "alt": "3D visualization created with WebGL showing interactive elements",
    "github": "https://github.com/katulevskiy/project-four",
    "tags": "WebGL, 3D, ThreeJS, Performance Optimization"
  }
]
